README.org
* Nix and Emacs configuration

Contents of this file get tangled to $HOME via

#+begin_src elisp :results output silent
(org-babel-tangle)
#+end_src

This exports all configuration files under $HOME/.config/nixpkgs/.  The Nix user
environment gets populated by running

#+begin_src sh :results output silent
nix-env -iAr nixpkgs.tom
#+end_src

* Setting up a new box

This is a checklist for reinstalling my laptop.

1. Install Ubuntu. Remember to encrypt hard drives.
2. Install tools outside of Nix: dropbox, docker, nix.
3. Symlink $HOME/.gnupg and $HOME/.profile.
4. Tangle this file using a temporary nix-shell environment.

* Nix configuration

Most of my software gets installed via Nix.  First, proprietary software is
enabled in config.nix:

#+begin_src nix :mkdirp yes :tangle ~/.config/nixpkgs/config.nix
{ allowUnfree = true; }
#+end_src

Next, the list of packages gets defined in the following overlay:

#+begin_src nix :mkdirp yes :tangle ~/.config/nixpkgs/overlays/99-tom.nix
self: super: {
  tom = super.tom or {} // {
    emacs = self.lowPrio self.emacs; # emacs also writes .desktop => set lower priority
    emacs-custom-desktop = self.emacs-custom-desktop;
    nix = self.nix;
    conda = self.conda;
    slack = self.slack;
    gnupg = self.gnupg;
    pass = self.pass;
    ripgrep = self.ripgrep;
    htop = self.htop;
    gmsh = self.gmsh;
    suitesparse = self.suitesparse;
    gnumake = self.gnumake;
    xclip = self.xclip;
    graphviz = self.graphviz;
    git = self.git;
    vim = self.vim;
    pandoc = self.pandoc;
  };
}
#+end_src

